/*
 * cpnInit.h
 *
 *  Created on: 2018年8月18日
 *      Author: pxf
 */

#ifndef CPNINIT_H_
#define CPNINIT_H_

#include "..\01_std\std.h"

// --------------------------------------------------------------
// 组件初始化
// --------------------------------------------------------------
// 组件输入初始化------------------------


// 组件初始化----------------------------
int16 cpnInit(void); // 0成功，-1失败

// 组件输出初始化------------------------
int16 vfbOcpnInit(void);

// 管理组件初始化外部声明----------------
extern int16 vfbMcpnInit(void);

#endif /* CPNINIT_H_ */
