/*
 * abicsLedServ.c
 *
 *  Created on: 2018年8月22日
 *      Author: pxf
 */

#include "abicsLedServ.h"
#include "..\..\03_bsp\bsp.h"

// --------------------------------------------------------------
// 组件抽象接口初始化
// --------------------------------------------------------------
int16 abicsLedServInit(void)
{
    int16 rtv = 0;

    CN(go, &led, bspGoLed);
    if (OPRS(led) == OOPC_NULL)
    {
        rtv++;
    }

    return rtv;
}

// --------------------------------------------------------------
// 组件抽象接口
// --------------------------------------------------------------
// 输出类抽象接口------------------------
go led;

