/*
 * abicsLedServ.h
 *
 *  Created on: 2018年8月22日
 *      Author: pxf
 */

#ifndef ABICSLEDSERV_H_
#define ABICSLEDSERV_H_

#include "..\abi.h"

// --------------------------------------------------------------
// 组件抽象接口初始化
// --------------------------------------------------------------
int16 abicsLedServInit(void);

// --------------------------------------------------------------
// 组件抽象接口
// --------------------------------------------------------------
// 输出类抽象接口------------------------
extern go led;

#endif /* ABICSLEDSERV_H_ */
