/*
 * abicasSch.h
 *
 *  Created on: 2018年8月22日
 *      Author: pxf
 */

#ifndef ABICASSCH_H_
#define ABICASSCH_H_

#include "..\abi.h"

// --------------------------------------------------------------
// 组件抽象接口初始化
// --------------------------------------------------------------
int16 abicasSchInit(void);

// --------------------------------------------------------------
// 组件抽象接口
// --------------------------------------------------------------
// 线程类抽象接口------------------------
extern isr timer;
extern isr mainLoop;

// 时间测量类抽象接口--------------------
extern measure time;

#endif /* ABICASSCH_H_ */
