/**************************************************************************
* @copyright    :Copyright(C), 2018, pxf, person.
* @file         :vfbMcpnInit.h
* @author       :pxf
* @version      :v1.0
* @date         :2018/08/31 20:52:28
* @brief        :组件cpnInit 管理类数据类型声明
* @others       :
* @history      :180831 pxf 初次建立
***************************************************************************/

#ifndef VFBMCPNINIT_H_
#define VFBMCPNINIT_H_

#include "../../05_cpnInit/cpnInit.h"

/***********************************************************
* 组件管理初始化
***********************************************************/
/*组件管理初始化
* 输入: 无
* 输出: int16 0-成功,-1-失败
***********************************************/
int16 vfbMcpnInit(void);

#endif /* VFBMCPNINIT_H_ */

/**************************** Copyright(C) pxf ****************************/
