/**************************************************************************
* @copyright    :Copyright(C), 2018, pxf, person.
* @file         :vfbMcpnInit.c
* @author       :pxf
* @version      :v1.0
* @date         :2018/08/31 20:52:28
* @brief        :组件cpnInit 管理类定义
* @others       :
* @history      :180831 pxf 初次建立
***************************************************************************/

#include "vfbMcpnInit.h"
#include "../../04_abi/abi.h"
#include "../../06_cas/casSch/casSch.h"

/***********************************************************
* 组件管理初始化
***********************************************************/
/*组件管理初始化
* 输入: 无
* 输出: int16 0-成功,-1-失败
***********************************************/
int16 vfbMcpnInit(void)
{
    int16 rtv = 0;

    rtv |= vfbIabiInit();
    rtv |= vfbIcasSchInit();

    return rtv;
}

/**************************** Copyright(C) pxf ****************************/
