/**************************************************************************
* @copyright    :Copyright(C), 2018, pxf, person.
* @file         :cpnInit.h
* @author       :pxf
* @version      :v1.0
* @date         :2018/08/31 23:21:10
* @brief        :组件cpnInit 数据类型声明头文件
* @others       :
* @history      :180831 pxf 初次建立
***************************************************************************/

#ifndef CPNINIT_H_
#define CPNINIT_H_

#include "../01_std/std.h"

/***********************************************************
* 组件初始化
***********************************************************/
/*组件输入初始化
* 输入: 无
* 输出: int16 0-成功,-1-失败
***********************************************/
//int16 vfbIcpnInit(void);

/*组件初始化
* 输入: 无
* 输出: int16 0-成功,-1-失败
***********************************************/
int16 cpnInit(void);

/*组件输出初始化
* 输入: 无
* 输出: int16 0-成功,-1-失败
***********************************************/
int16 vfbOcpnInit(void);

/*管理组件初始化外部声明
* 输入: 无
* 输出: int16 0-成功,-1-失败
***********************************************/
extern int16 vfbMcpnInit(void);


#endif /* CPNINIT_H_ */

/**************************** Copyright(C) pxf ****************************/
