/*
 * abi.c
 *
 *  Created on: 2018年8月17日
 *      Author: pxf
 */

#include "abi.h"

// --------------------------------------------------------------
// 组组件输入初始化
// --------------------------------------------------------------
int16 vfbIabiInit(void)
{
    return abiInit();
}

// --------------------------------------------------------------
// 组件初始化
// --------------------------------------------------------------
int16 abiInit(void)
{
    int16 rtv = 0;

    rtv |= abicasSchInit();
//    rtv |= abicsLedServInit();

    return rtv;
}




