/**************************************************************************
* @copyright    :Copyright(C), 2018, pxf, person.
* @file         :inf.h
* @author       :pxf
* @version      :v1.0
* @date         :2018/09/01 16:25:01
* @brief        :接口类型声明
* @others       :
* @history      :180901 pxf 初次建立
***************************************************************************/

#ifndef INF_H_
#define INF_H_

/*线程类接口
***********************************************/
INF(iIsr)
{
    void (*isr)(void);
};

/*时间测量接口
***********************************************/
INF(iMeasure)
{
    void (*start)(uint32 *point);
    uint32 (*end)(uint32 point);
};

/*GIO输入接口
***********************************************/
INF(iGi)
{
    uint16 (*get)(void);
};
/*GIO输出接口
***********************************************/
INF(iGo)
{
    void (*set)(uint16 sw);
};

#endif /* INF_H_ */

/**************************** Copyright(C) pxf ****************************/
